xpacks/stm32f7-cmsis/CMSIS/Driver/MCI_STM32F7xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2015 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        15. October 2015
 * $Revision:    V1.3
 *
 * Driver:       Driver_MCI0
 * Configured:   via RTE_Device.h configuration file
 * Project:      MCI Driver for ST STM32F7xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                 Value
 *   ---------------------                 -----
 *   Connect to hardware via Driver_MCI# = 0
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.3
 *    Corrected PowerControl function for:
 *      - Unconditional Power Off
 *      - Conditional Power full (driver must be initialized)
 *  Version 1.2
 *    Clock power save bit handling removed from ARM_MCI_BUS_SPEED control
 *  Version 1.1
 *    Enhanced STM32CubeMx compatibility
 *  Version 1.0
 *    Initial release
 */

/*! \page stm32f7_mci CMSIS-Driver MCI Setup 

The CMSIS-Driver MCI requires:
  - Setup of SDMMC1 with DMA for Rx and Tx DMA transfers.
  - Optional Configuration for Card Detect Pin:
    - Configure arbitrary pin in GPIO_Input mode and add User Label: MemoryCard_CD
  - Optional Configuration for Write Protect Pin:
    - Configure arbitrary pin in GPIO_Input mode and add User Label: MemoryCard_WP

\note The User Label name is used to connect the CMSIS-Driver to the GPIO pin.

The example below uses correct settings for STM32F746G-Discovery:  
  - SDMMC1 Mode:             SD 4bits Wide bus 
  - Card Detect Input pin:   PC13
  - Write Protect Input pin: not available

For different boards, refer to the hardware schematics to reflect correct setup values.

The STM32CubeMX configuration steps for Pinout, Clock, and System Configuration are 
listed below. Enter the values that are marked \b bold.
   
Pinout tab
----------
  1. Configure SDMMC1 mode
     - Peripherals \b SDMMC1: Mode=<b>SD 4 bits Wide bus</b>
  2. Configure Card Detect pin:
     - Click in chip diagram on pin \b PC13 and select \b GPIO_Input. 
          
Clock Configuration tab
-----------------------
  1. Configure SDMMC Clock: "To SDMMC (MHz)": 48
  
Configuration tab
-----------------
  1. Under Connectivity open \b SDMMC1 Configuration:
     - <b>DMA Settings</b>: setup DMA transfers for Rx and Tx\n
       \b Add - Select \b SDMMC1_RX: Stream=DMA2 Stream 3, Direction=Peripheral to Memory, Priority=Low
          DMA Request Settings                  | Label             | Peripheral  | Memory
          :-------------------------------------|:------------------|:------------|:-------------
          Mode: <b>Peripheral Flow Control</b>  | Increment Address | off         |\b ON
          Use Fifo \b ON  Threshold: Full       | Data Width        |\b WORD      |\b WORD
          .                                     | Burst Size        |\b 4 Increm..|\b 4 Increm..
       \b Add - Select \b SDMMC1_TX: Stream=DMA2 Stream 6, Direction=Memory to Peripheral, Priority=Low
          DMA Request Settings                  | Label             | Peripheral  | Memory
          :-------------------------------------|:------------------|:------------|:-------------
          Mode: <b>Peripheral Flow Control</b>  | Increment Address | off         |\b ON
          Use Fifo \b ON  Threshold: Full       | Data Width        |\b WORD      |\b WORD
          .                                     | Burst Size        |\b 4 Increm..|\b 4 Increm..

     - <b>GPIO Settings</b>: review settings, no changes required
          Pin Name | Signal on Pin | GPIO mode | GPIO Pull-up/Pull..| Maximum out | User Label
          :--------|:--------------|:----------|:-------------------|:------------|:----------
          PC8      | SDMMC1_D0     | Alternate | No pull-up and no..| High        |.
          PC9      | SDMMC1_D1     | Alternate | No pull-up and no..| High        |.
          PC10     | SDMMC1_D2     | Alternate | No pull-up and no..| High        |.
          PC11     | SDMMC1_D3     | Alternate | No pull-up and no..| High        |.
          PC12     | SDMMC1_CK     | Alternate | No pull-up and no..| High        |.
          PD2      | SDMMC1_CMD    | Alternate | No pull-up and no..| High        |.

     - <b>NVIC Settings</b>: enable interrupts
          Interrupt Table                      | Enable | Preemption Priority | Sub Priority
          :------------------------------------|:-------|:--------------------|:--------------
          SDMMC1 global interrupt              |\b ON   | 0                   | 0
          DMA2 stream3 global interrupt        |   ON   | 0                   | 0
          DMA2 stream6 global interrupt        |   ON   | 0                   | 0

     - Parameter Settings: not used
     - User Constants: not used

     Click \b OK to close the SDMMC1 Configuration dialog
  2. Under System open \b GPIO Pin Configuration
     - Enter user label for Card Detect pin
          Pin Name | Signal on Pin | GPIO mode | GPIO Pull-up/Pull..| Maximum out | User Label
          :--------|:--------------|:----------|:-------------------|:------------|:----------
          PC13     | n/a           | Input mode| No pull-up and no..| n/a         |\b MemoryCard_CD

     Click \b OK to close the Pin Configuration dialog
*/

/*! \cond */

#include "MCI_STM32F7xx.h"

#define ARM_MCI_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,3)  /* driver version */

/* Define Card Detect pin active state */
#if !defined(MemoryCard_CD_Pin_Active)
  #define MemoryCard_CD_Pin_Active GPIO_PIN_RESET
#endif

/* Define Write Protect pin active state */
#if !defined(MemoryCard_WP_Pin_Active)
  #define MemoryCard_WP_Pin_Active GPIO_PIN_SET
#endif

/* Disable High Speed bus mode */
#if defined(MemoryCard_Bus_Mode_HS_Disable)
  #define MCI_BUS_MODE_HS    0U
#else
  #define MCI_BUS_MODE_HS    1U
#endif

#if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
extern SD_HandleTypeDef hsd1;
#endif

