xpacks/stm32f7-cmsis/CMSIS/Driver/MCI_STM32F7xx.c
      GPIO_InitStruct.Pin = GPIO_PIN_8|GPIO_PIN_9;
      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull = GPIO_PULLUP;
      GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
      GPIO_InitStruct.Alternate = GPIO_AF12_SDMMC1;
      HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

      GPIO_InitStruct.Pin = GPIO_PIN_7|GPIO_PIN_6;
      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull = GPIO_PULLUP;
      GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
      GPIO_InitStruct.Alternate = GPIO_AF12_SDMMC1;
      HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    #endif

    /* Configure CD (Card Detect) Pin */
    #if defined (MX_MemoryCard_CD_Pin)
      #if defined (USE_STM32756G_EVAL)
        BSP_IO_Init();
        BSP_IO_ConfigPin(IO_PIN_15, IO_MODE_INPUT_PU);
      #else
        Enable_GPIO_Clock (MX_MemoryCard_CD_GPIOx);

        GPIO_InitStruct.Pin  = MX_MemoryCard_CD_GPIO_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = MX_MemoryCard_CD_GPIO_PuPd;
        HAL_GPIO_Init(MX_MemoryCard_CD_GPIOx, &GPIO_InitStruct);
      #endif
    #endif

    /* Configure WP (Write Protect) Pin */
    #if defined (MX_MemoryCard_WP_Pin)
      Enable_GPIO_Clock (MX_MemoryCard_WP_GPIOx);

      GPIO_InitStruct.Pin  = MX_MemoryCard_WP_GPIO_Pin;
      GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
      GPIO_InitStruct.Pull = MX_MemoryCard_WP_GPIO_PuPd;
      HAL_GPIO_Init(MX_MemoryCard_WP_GPIOx, &GPIO_InitStruct);
    #endif

    /* Enable DMA peripheral clock */
    __HAL_RCC_DMA2_CLK_ENABLE();

    /* Configure DMA receive stream */
    hdma_sdmmc1_rx.Instance                 = MX_SDMMC1_RX_DMA_Instance;
    hdma_sdmmc1_rx.Init.Channel             = MX_SDMMC1_RX_DMA_Channel;
    hdma_sdmmc1_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    hdma_sdmmc1_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma_sdmmc1_rx.Init.MemInc              = DMA_MINC_ENABLE;
    hdma_sdmmc1_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hdma_sdmmc1_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    hdma_sdmmc1_rx.Init.Mode                = DMA_PFCTRL;
    hdma_sdmmc1_rx.Init.Priority            = MX_SDMMC1_RX_DMA_Priority;
    hdma_sdmmc1_rx.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
    hdma_sdmmc1_rx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    hdma_sdmmc1_rx.Init.MemBurst            = DMA_MBURST_INC4;
    hdma_sdmmc1_rx.Init.PeriphBurst         = DMA_PBURST_INC4;

    if (HAL_DMA_Init(&hdma_sdmmc1_rx) != HAL_OK) {
      return ARM_DRIVER_ERROR;
    }

    /* Configure DMA transmit stream */
    hdma_sdmmc1_tx.Instance                 = MX_SDMMC1_TX_DMA_Instance;
    hdma_sdmmc1_tx.Init.Channel             = MX_SDMMC1_TX_DMA_Channel;
    hdma_sdmmc1_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    hdma_sdmmc1_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma_sdmmc1_tx.Init.MemInc              = DMA_MINC_ENABLE;
    hdma_sdmmc1_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hdma_sdmmc1_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    hdma_sdmmc1_tx.Init.Mode                = DMA_PFCTRL;
    hdma_sdmmc1_tx.Init.Priority            = MX_SDMMC1_TX_DMA_Priority;
    hdma_sdmmc1_tx.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
    hdma_sdmmc1_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    hdma_sdmmc1_tx.Init.MemBurst            = DMA_MBURST_INC4;
    hdma_sdmmc1_tx.Init.PeriphBurst         = DMA_PBURST_INC4;

    if (HAL_DMA_Init(&hdma_sdmmc1_tx) != HAL_OK) {
      return ARM_DRIVER_ERROR;
    }
  #else
    hsd1.Instance = SDMMC1;
  #endif

  /* Set DMA callback function */
  hdma_sdmmc1_rx.XferCpltCallback = &RX_DMA_Complete;

  /* Clear control structure */
  memset (&MCI, 0, sizeof (MCI_INFO));

  MCI.cb_event = cb_event;
  MCI.flags    = MCI_INIT;

  return ARM_DRIVER_OK;
}


/**
  \fn            int32_t Uninitialize (void)
  \brief         De-initialize Memory Card Interface.
  \return        \ref execution_status
*/
static int32_t Uninitialize (void) {

  MCI.flags = 0U;

  #if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
    hsd1.Instance = NULL;
  #endif

  #if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
    /* SDMMC1_CMD, SDMMC1_CK and SDMMC1_D0 pins */
    HAL_GPIO_DeInit(GPIOD, GPIO_PIN_2);
    HAL_GPIO_DeInit(GPIOC, GPIO_PIN_12|GPIO_PIN_8);

    #if (MCI_BUS_WIDTH_4)
      /* SDMMC1_D[3..1] */
      HAL_GPIO_DeInit(GPIOC, GPIO_PIN_11|GPIO_PIN_10|GPIO_PIN_9);
    #endif

    #if (MCI_BUS_WIDTH_8)
      /* SDMMC1_D[7..4] */
      HAL_GPIO_DeInit(GPIOB, GPIO_PIN_8|GPIO_PIN_9);
      HAL_GPIO_DeInit(GPIOC, GPIO_PIN_7|GPIO_PIN_6);
    #endif
  #endif /* RTE_DEVICE_FRAMEWORK_CLASSIC */

  #if defined (MX_MemoryCard_CD_Pin)
    /* Unconfigure CD (Card Detect) Pin */
    #if defined (USE_STM32756G_EVAL)
      BSP_IO_ConfigPin(IO_PIN_15, IO_MODE_OFF);
    #else
      HAL_GPIO_DeInit (MX_MemoryCard_CD_GPIOx, MX_MemoryCard_CD_GPIO_Pin);
    #endif
  #endif

  #if defined (MX_MemoryCard_WP_Pin)
    /* Unconfigure WP (Write Protect) Pin */
    HAL_GPIO_DeInit (MX_MemoryCard_WP_GPIOx, MX_MemoryCard_WP_GPIO_Pin);
  #endif

  return ARM_DRIVER_OK;
}


/**
  \fn            int32_t PowerControl (ARM_POWER_STATE state)
  \brief         Control Memory Card Interface Power.
  \param[in]     state   Power state \ref ARM_POWER_STATE
  \return        \ref execution_status
*/
static int32_t PowerControl (ARM_POWER_STATE state) {
  int32_t status;

  status = ARM_DRIVER_OK;

  switch (state) {
    case ARM_POWER_OFF:
      /* Reset/Dereset SDMMC1 peripheral */
      __HAL_RCC_SDMMC1_FORCE_RESET();
      __NOP(); __NOP(); __NOP(); __NOP();
      __HAL_RCC_SDMMC1_RELEASE_RESET();

      #if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
        /* Disable SDIO interrupts in NVIC */
        HAL_NVIC_DisableIRQ (SDMMC1_IRQn);

        /* Disable DMA stream interrupts in NVIC */
        if (hdma_sdmmc1_rx.Instance != NULL) {
          HAL_NVIC_DisableIRQ (SDMMC1_RX_DMA_IRQn);
        }
        if (hdma_sdmmc1_tx.Instance != NULL) {
          HAL_NVIC_DisableIRQ (SDMMC1_TX_DMA_IRQn);
        }

        /* Disable DMA stream */
        if (hdma_sdmmc1_rx.Instance != NULL) {
          if (HAL_DMA_DeInit (&hdma_sdmmc1_rx) != HAL_OK) {
            status = ARM_DRIVER_ERROR;
          }
        }
        if (hdma_sdmmc1_tx.Instance != NULL) {
          if (HAL_DMA_DeInit (&hdma_sdmmc1_tx) != HAL_OK) {
            status = ARM_DRIVER_ERROR;
          }
        }

        /* SDMMC1 peripheral clock disable */
        __HAL_RCC_SDMMC1_CLK_DISABLE();
      #else
        if (hsd1.Instance != NULL) {
          HAL_SD_MspDeInit (&hsd1);
        }
      #endif

      /* Clear status */
      MCI.status.command_active   = 0U;
      MCI.status.command_timeout  = 0U;
      MCI.status.command_error    = 0U;
      MCI.status.transfer_active  = 0U;
      MCI.status.transfer_timeout = 0U;
      MCI.status.transfer_error   = 0U;
      MCI.status.sdio_interrupt   = 0U;
      MCI.status.ccs              = 0U;

      MCI.flags &= ~MCI_POWER;
      break;

    case ARM_POWER_FULL:
      if ((MCI.flags & MCI_INIT)  == 0U) {
        return ARM_DRIVER_ERROR;
      }
      if ((MCI.flags & MCI_POWER) != 0U) {
        return ARM_DRIVER_OK;
      }
      #if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
        HAL_SD_MspInit (&hsd1);
      #else
      /* Enable SDMMC1 peripheral clock */
      __HAL_RCC_SDMMC1_CLK_ENABLE();
      #endif

      /* Clear response and transfer variables */
      MCI.response = NULL;
      MCI.xfer.cnt = 0U;

